#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repository_rust_lib["itest"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "lib-itest"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "lib-itest"
    }

  # module.repository_rust_lib["itest"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "lib-itest"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_lib["itest"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "**/**"
      + repository_id                   = "lib-itest"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_lib["itest"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "lib-itest"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "/arrow-github-bot",
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_lib["itest"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "lib-itest"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_lib["itest"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Library - Integration testing library for Arrow services."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "lib-itest"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "Arrow-air"
          + repository           = "lib-template-rust"
        }
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (DO NOT EDIT!)
            [//]: # (This file was provisioned by Terraform)
            [//]: # (File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.cargo-husky/hooks/README.md)
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cargo-husky/hooks/commit-msg"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            export COMMITLINT_CHECK=${1}
            make commitlint-test
        EOT
      + file                = ".cargo-husky/hooks/commit-msg"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.cargo-husky/hooks/pre-commit
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # Tests
            make test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.cargo-husky/hooks/pre-push
            ##
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.cargo/config.toml
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - 'node_modules'
              - 'build'
              - '*.css'
              - '*.svg'
              - '*/**Makefile'
              - 'target'
              - 'out'
              - 'coverage'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-itest
            PACKAGE_NAME=lib-itest
            PUBLISH_PACKAGE_NAME=lib-itest
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/workflows/nightly.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
      + file                = ".github/workflows/nightly.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/python_ci.yml
            
            on:
              pull_request:
                branches:
                  - develop
                  - main
                paths:
                  - '**.py'
            
            name: Python Checks
            
            env:
              TERM: xterm
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make python-test
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
            
            on:
              pull_request:
                branches:
                  - develop
                  - main
                paths:
                  - server/**
                  - client-grpc/**
                  - client-rest/**
                  - src/**
                  - Cargo.lock
                  - Cargo.toml
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                if: ${{ !contains(github.event.head_commit.message, 'provisioned by terraform') }}
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                if: ${{ !contains(github.event.head_commit.message, 'provisioned by terraform') }}
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
            
              # Validates the code examples in doc comments
              doc:
                name: Rustdoc
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-doc
            
              coverage:
                name: Unit Test Coverage
                runs-on: ubuntu-latest
                env:
                  NODE_COVERALLS_DEBUG: 1
                steps:
                  - uses: actions/checkout@v2
                  - run: |
                      mkdir -p coverage
                      make rust-coverage | tee coverage/ut.txt
                      echo UT_COV=$(sed '/||/,$!d' coverage/ut.txt) >> $GITHUB_ENV
                  - uses: coverallsapp/github-action@master
                    with:
                      github-token: ${{ secrets.github_token }}
                      path-to-lcov: coverage/lcov.info
                      base-path: .
                  - uses: thollander/actions-comment-pull-request@v1
                    continue-on-error: true
                    with:
                      message: |
                        :beetle: Unit Testing Coverage :mag_right:
            
                        ${{ env.UT_COV }}
            
                        :point_right: [View in Coveralls.io](https://coveralls.io/github/${{ github.repository }}) :point_left:
                      comment_includes: ':beetle: Unit Testing Coverage :mag_right:'
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              pull_request:
                branches:
                  - develop
                  - main
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
            
              toml:
                name: TOML Format Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make toml-test
            
              commit-msg:
                name: Commit message Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      fetch-depth: 0
                  - run: npx commitlint --from=${{ github.event.pull_request.base.sha }}
            
              release-notes:
                name: Preview Release Notes
                runs-on: ubuntu-latest
                steps:
                  - name: Checkout Code
                    uses: actions/checkout@v3
                    with:
                      fetch-depth: 0
            
                  - name: Generate Changelog
                    id: changelog
                    uses: mrchief/universal-changelog-action@v1.3.1
                    with:
                      previousReleaseTagNameOrSha: ${{ github.event.pull_request.base.sha }}
                      nextReleaseTagName: ${{ github.sha }}
                      nextReleaseName: "Release ${{ steps.tag_version.outputs.new_version }}"
            
                  - name: Add PR Comment with Changelog Output
                    uses: thollander/actions-comment-pull-request@v1
                    continue-on-error: true
                    with:
                      message: |
                        <details>
                        <summary>This PR will generate the following release notes when merged:</summary>
            
                        ${{ steps.changelog.outputs.changelog }}
            
                        </details>
                      comment_includes: 'This PR will generate the following release notes when merged'
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.gitignore.tftpl
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            *.env
            
            # Local cargo cache generated by make targets
            .cargo/registry
            
            
            
            # Libraries should ignore Cargo.lock
            # Executables should track Cargo.lock
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            Cargo.lock
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode or idea meta files
            .vscode
            .idea
            
            # Don't add DS_Store
            .DS_Store
            
            # Logger Output
            log/
            
            # Outputs
            out/
            
            # Coverage output
            coverage/
            *.profraw
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.1
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/docker.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/docker.mk
            
            DOCKER_BUILD_PATH ?= .
            
            .help-docker:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Docker targets$(SGR0)"
            	@echo "  $(BOLD)docker-build$(SGR0)   -- Run docker build to create new image"
            	@echo "  $(BOLD)docker-run$(SGR0)     -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)docker-stop$(SGR0)    -- Run 'docker kill $${DOCKER_NAME}-run' to stop our docker after running"
            
            docker-build:
            	@DOCKER_BUILDKIT=1 docker build --build-arg PACKAGE_NAME=$(PACKAGE_NAME) --tag $(PACKAGE_NAME):latest $(DOCKER_BUILD_PATH)
            
            docker-run: docker-stop
            	# Run docker container as a daemon and map a port
            	@docker run --rm -d --env-file .env -p $(HOST_PORT_GRPC):$(DOCKER_PORT_GRPC) -p $(HOST_PORT_REST):$(DOCKER_PORT_REST) --name=$(DOCKER_NAME)-run $(PACKAGE_NAME):latest
            	@echo "$(YELLOW)Docker running and listening to http://localhost:$(HOST_PORT_GRPC) and http://localhost:$(HOST_PORT_REST) $(SGR0)"
            
            docker-stop:
            	@docker kill ${DOCKER_NAME}-run || true
        EOT
      + file                = ".make/docker.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:stable \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/python.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/python.mk
            
            PYTHON_PATH=""
            
            .help-python:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '**/.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '**/.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            
            # Python / yapf, flake8 targets
            python-test: docker-pull
            	@echo "$(CYAN)Formatting and checking Python files with Google style...$(SGR0)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude "$(PYTHON_PATH).cargo/registry" .)
            	@echo "$(CYAN)Formatting and checking Python files with flake8 style...$(SGR0)"
            	@$(call docker_run,flake8 --exclude "$(PYTHON_PATH).cargo/registry" .)
            
            python-tidy: docker-pull
            	@echo "$(CYAN)Running python file formatting fixes...$(SGR0)"
            	@$(call docker_run,black --extend-exclude $(PYTHON_PATH).cargo .)
        EOT
      + file                = ".make/python.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/rust.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/rust.mk
            
            RUST_IMAGE_NAME     ?= ghcr.io/arrow-air/tools/arrow-rust
            RUST_IMAGE_TAG      ?= 1.1
            CARGO_MANIFEST_PATH ?= Cargo.toml
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            PUBLISH_DRY_RUN     ?= 1
            OUTPUTS_PATH        ?= $(SOURCE_PATH)/out
            ADDITIONAL_OPT      ?=
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(SGR0)"
            else
            cargo_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	$(ADDITIONAL_OPT) \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	-v "$(SOURCE_PATH)/.cargo/registry:/usr/local/cargo/registry" \
            	-e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
            	-e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
            	-t $(RUST_IMAGE_NAME):$(RUST_IMAGE_TAG) \
            	cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2)
            endif
            
            rust-docker-pull:
            	@echo docker pull -q $(RUST_IMAGE_NAME):$(RUST_IMAGE_TAG)
            
            .help-rust:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(SGR0)"
            	@echo "  $(BOLD)rust-build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)rust-release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                     (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)rust-publish$(SGR0)     -- Run 'cargo publish --package $(PUBLISH_PACKAGE_NAME)'"
            	@echo "                     uses '--dry-run' by default, automation uses PUBLISH_DRY_RUN=0 to upload crate"
            	@echo "  $(BOLD)rust-clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)       -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)        -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-example-ARG$(SGR0) -- Run 'cargo run --example ARG' (replace ARG with example name)"
            	@echo "  $(BOLD)rust-clippy$(SGR0)      -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)         -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)        -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo "  $(BOLD)rust-doc$(SGR0)         -- Run 'cargo doc --all' to produce rust documentation."
            	@echo "  $(BOLD)rust-openapi$(SGR0)     -- Run 'cargo run -- --api ./out/$(PACKAGE_NAME)-openapi.json'."
            	@echo "  $(BOLD)rust-validate-openapi$(SGR0) -- Run validation on the ./out/$(PACKAGE_NAME)-openapi.json."
            	@echo "  $(BOLD)rust-grpc-api$(SGR0)    -- Generate a $(PACKAGE_NAME)-grpc-api.json from proto/*.proto files."
            	@echo "  $(BOLD)rust-coverage$(SGR0)    -- Run tarpaulin unit test coverage report"
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)rust-test-all$(SGR0)    -- Run targets: rust-build rust-check rust-test rust-clippy rust-fmt"
            	@echo "  $(BOLD)rust-all$(SGR0)         -- Run targets; rust-clean rust-test-all rust-release"
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(SOURCE_PATH)/.cargo/registry" ]; then mkdir -p "$(SOURCE_PATH)/.cargo/registry" ; fi
            
            .SILENT: check-cargo-registry rust-docker-pull
            
            rust-build: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo build...$(SGR0)"
            	@$(call cargo_run,build)
            
            rust-release: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo build --release...$(SGR0)"
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            rust-publish: rust-build
            	@echo "$(CYAN)Running cargo publish --package $(PUBLISH_PACKAGE_NAME)...$(SGR0)"
            ifeq ("$(PUBLISH_DRY_RUN)", "0")
            	@echo $(call cargo_run,publish,--package $(PUBLISH_PACKAGE_NAME) --target $(RELEASE_TARGET))
            else
            	@$(call cargo_run,publish,--dry-run --package $(PUBLISH_PACKAGE_NAME) --target $(RELEASE_TARGET))
            endif
            
            rust-clean: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo clean...$(SGR0)"
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo check...$(SGR0)"
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo test...$(SGR0)"
            	@$(call cargo_run,test,--all)
            
            rust-example-%: EXAMPLE_TARGET=$*
            rust-example-%: check-cargo-registry rust-docker-pull
            	@docker compose run \
            		--user `id -u`:`id -g` \
            		--rm \
            		-e CARGO_INCREMENTAL=1 \
            		-e RUSTC_BOOTSTRAP=0 \
            		-e EXAMPLE_TARGET=$(EXAMPLE_TARGET) \
            		-e SERVER_PORT_GRPC=$(DOCKER_PORT_GRPC) \
            		-e SERVER_PORT_REST=$(DOCKER_PORT_REST) \
            		-e SERVER_HOSTNAME=$(DOCKER_NAME)-example-server \
            		example && docker compose down
            
            rust-clippy: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running clippy...$(SGR0)"
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running and checking Rust codes formats...$(SGR0)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running rust file formatting fixes...$(SGR0)"
            	@$(call cargo_run,fmt,--all)
            
            rust-doc: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Running cargo doc...$(SGR0)"
            	@$(call cargo_run,doc,--no-deps)
            
            rust-openapi: check-cargo-registry rust-docker-pull rust-build
            	@echo "$(CYAN)Generating openapi documentation...$(SGR0)"
            	mkdir -p $(OUTPUTS_PATH)
            	@$(call cargo_run,run,-- --openapi ./out/$(PACKAGE_NAME)-openapi.json)
            
            rust-validate-openapi: rust-openapi
            	@docker run \
            		--rm \
            		-v $(OUTPUTS_PATH):/out \
            		jeanberu/swagger-cli \
            		swagger-cli validate /out/$(PACKAGE_NAME)-openapi.json
            
            rust-grpc-api:
            	@echo "$(CYAN)Generating GRPC documentation...$(SGR0)"
            	mkdir -p $(OUTPUTS_PATH)
            	@docker run \
            		--rm \
            		--user `id -u`:`id -g` \
            		-v $(SOURCE_PATH)/proto:/protos \
            		-v $(OUTPUTS_PATH):/out \
            		pseudomuto/protoc-gen-doc \
            		--doc_opt=json,$(PACKAGE_NAME)-grpc-api.json
            
            rust-coverage: ADDITIONAL_OPT = --security-opt seccomp='unconfined'
            rust-coverage: check-cargo-registry rust-docker-pull
            	@echo "$(CYAN)Rebuilding and testing with profiling enabled...$(SGR0)"
            	@mkdir -p coverage/
            	@$(call cargo_run,tarpaulin,\
            		--workspace -l --include-tests --tests --no-fail-fast \
            		--all-features --out Lcov \
            		--output-dir coverage/)
            	@sed -e "s/\/usr\/src\/app\///g" -i coverage/lcov.info
            
            rust-test-all: rust-build rust-check rust-test rust-clippy rust-fmt rust-doc
            rust-all: rust-clean rust-test-all rust-release
        EOT
      + file                = ".make/rust.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".make/toml.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/toml.mk
            
            TOML_FILES ?= $(shell find . -type f -iname '*.toml' ! -path "./target")
            
            .help-toml:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            
            toml-test: docker-pull
            ifeq ("$(TOML_FILES)", "")
            	@echo "$(YELLOW)No toml files found, skipping formatting tests...$(SGR0)"
            else
            	@echo "$(CYAN)Running toml file formatting tests...$(SGR0)"
            	@$(call docker_run,taplo format --check)
            endif
            
            toml-tidy: docker-pull
            ifeq ("$(TOML_FILES)", "")
            	@echo "$(YELLOW)No toml files found, skipping formatting fixes...$(SGR0)"
            else
            	@echo "$(CYAN)Running toml file formatting fixes...$(SGR0)"
            	@$(call docker_run,taplo format)
            endif
        EOT
      + file                = ".make/toml.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.taplo.toml
            exclude = ["**/.cargo/registry/**", "target/**"]
            
            [formatting]
            align_entries = true
            reorder_keys  = false
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Business Source License 1.1
            
            License text copyright (c) 2017 MariaDB Corporation Ab, All Rights Reserved.
            "Business Source License" is a trademark of MariaDB Corporation Ab.
            
            -----------------------------------------------------------------------------
            
            Parameters
            
            Licensor:             Arrow DAO
            
            Licensed Work:        Arrow Services
                                  The Licensed Work is (c) 2022 Arrow DAO
            
            Additional Use Grant: Limited production uses, or as otherwise permitted by
                                  Arrow DAO governance vote
            
            Change Date:          for each release of lib-itest, the earlier of (i) two
                                  years from the release date, or (ii) a date specified at
                                  https://github.com/Arrow-air/lib-itest/blob/main/README.md
            
            Change License:       GNU Affero General Public License v3.0 or later
            
            -----------------------------------------------------------------------------
            
            Terms
            
            The Licensor hereby grants you the right to copy, modify, create derivative
            works, redistribute, and make non-production use of the Licensed Work. The
            Licensor may make an Additional Use Grant, above, permitting limited
            production use.
            
            Effective on the Change Date, or the fourth anniversary of the first publicly
            available distribution of a specific version of the Licensed Work under this
            License, whichever comes first, the Licensor hereby grants you rights under
            the terms of the Change License, and the rights granted in the paragraph
            above terminate.
            
            If your use of the Licensed Work does not comply with the requirements
            currently in effect as described in this License, you must purchase a
            commercial license from the Licensor, its affiliated entities, or authorized
            resellers, or you must refrain from using the Licensed Work.
            
            All copies of the original and modified Licensed Work, and derivative works
            of the Licensed Work, are subject to this License. This License applies
            separately for each version of the Licensed Work and the Change Date may vary
            for each version of the Licensed Work released by Licensor.
            
            You must conspicuously display this License on each original or modified copy
            of the Licensed Work. If you receive the Licensed Work in original or
            modified form from a third party, the terms and conditions set forth in this
            License apply to your use of that work.
            
            Any use of the Licensed Work in violation of this License will automatically
            terminate your rights under this License for the current and all other
            versions of the Licensed Work.
            
            This License does not grant you any right in any trademark or logo of
            Licensor or its affiliates (provided that you may use a trademark or logo of
            Licensor as expressly required by this License).
            
            TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON
            AN "AS IS" BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,
            EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF
            MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND
            TITLE.
            
            MariaDB hereby grants you permission to use this License’s text to license
            your works, and to refer to it using the trademark "Business Source License",
            as long as you comply with the Covenants of Licensor below.
            
            -----------------------------------------------------------------------------
            
            Covenants of Licensor
            
            In consideration of the right to use this License’s text and the "Business
            Source License" name and trademark, Licensor covenants to MariaDB, and to all
            other recipients of the licensed work to be provided by Licensor:
            
            1. To specify as the Change License the GPL Version 2.0 or any later version,
               or a license that is compatible with GPL Version 2.0 or a later version,
               where "compatible" means that software provided under the Change License can
               be included in a program with software provided under GPL Version 2.0 or a
               later version. Licensor may specify additional Change Licenses without
               limitation.
            
            2. To either: (a) specify an additional grant of rights to use that does not
               impose any additional restriction on the right granted in this License, as
               the Additional Use Grant; or (b) insert the text "None".
            
            3. To specify a Change Date.
            
            4. Not to modify this License in any other way.
            
            -----------------------------------------------------------------------------
            
            Notice
            
            The Business Source License (this document, or the "License") is not an Open
            Source license. However, the Licensed Work will eventually be made available
            under an Open Source License, as stated in this License.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/Makefile
            
            include .make/env.mk
            export
            
            help: .help-base .help-rust .help-python .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-toml
            build: rust-build
            clean: rust-clean
            release: rust-release
            publish: rust-publish
            test: rust-test-all cspell-test toml-test python-test md-test-links editorconfig-test
            tidy: rust-tidy toml-tidy python-tidy editorconfig-tidy
            all: clean test build release publish
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/commitlint.mk
            include .make/toml.mk
            include .make/rust.mk
            include .make/python.mk
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository lib-itest
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-itest"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["itest"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "lib-itest"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_lib["itest"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "lib-itest"
      + team_id    = "services"
    }

Plan: 39 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*